package com.yatsynaekateryna.lessons.lesson11;
import com.sun.org.apache.xalan.internal.xsltc.compiler.util.NodeSetType;
public class main {
    public static void main(String[] args) {
//        IMap map = new HashTable();
//        map.add("apple");
//        map.add("good");
//        map.add("nice");
//        map.add("friend");
//        map.add("love");
//        map.add("love");
//        map.add("love");
//        map.add("hello");
//        map.add("sun");
//        map.add("sun");
//        map.add("sun");
//        System.out.println(map);

        //1.Вывести самый распространенный символ в строке. Например для “abcdabbb” вывести b.
        // Если несколько символов встречаются одинаковое кол раз - вывести любой.
//        String str = "abcdabbb";
//        IMap hashTable = new HashTable();



        //2.Вывести индексы самого распространенного символа в строке. Например для “abcdabbb” вывести b : {0, 5, 6, 7}.
        // Если несколько символов встречаются одинаковое кол раз - вывести любой.


        //3. Вывести топ 10 самый частых слов в романе на англ. языке. (В английском нет падежей, так проще). Роман на выбор.


    }
}
